var MyJson = function () {
    //职位
    var possition = ["社长","副社长","宣传部长","财务部长","外联部长","组织部长"];
    //学院
    //var college = [{"college":"石油与天然气工程学院","major":["石油工程","油气储运工程","海洋油气工程"]},{"college":"地球科学与技术学院","major":["资源勘查工程","勘查技术与工程","地质学","地理信息科学","城市地下空间工程"]}];
    var college = [
        {
            "college": "石油与天然气工程学院",
            "major": [
                "石油工程",
                "油气储运工程",
                "海洋油气工程"
            ]
        },
        {
            "college": "地球科学与技术学院",
            "major": [
                "资源勘查工程",
                "勘查技术与工程",
                "地质学",
                "地理信息科学",
                "城市地下空间工程"
            ]
        },
        {
            "college": "机电工程学院",
            "major": [
                "机械工程专业",
                "测控技术与仪器专业",
                "过程装备与控制工程专业",
                "机械设计制造及其自动化",
                "机械电子工程",
                "工业设计专业"
            ]
        },
        {
            "college": "计算机科学学院",
            "major": [
                "计算机科学与技术",
                "软件工程",
                "网络工程",
                "物联网工程",
                "信息管理与信息系统",
                "网络空间安全",
                "数据科学与大数据技术"
            ]
        },
        {
            "college": "化学化工学院",
            "major": [
                "应用化学",
                "环境工程",
                "化学专业",
                "安全工程"
            ]
        },
        {
            "college": "新能源与材料学院",
            "major": [
                "新能源材料与器件",
                "材料成型及控制工程",
                "材料科学与工程",
                "高分子材料与工程",
                "新能源科学与工程"
            ]
        }
    ];
    return{
        possition,
        college
    }
}();
$(document).ready(function () {
    return MyJson.possition;
    return MyJson.college;
});